Repository: IsayaOsward/rolanda_modified_version
Catalog: lib/config/localization/l10n/app_*.arb
Languages: sw

# settingsTitle
source: Settings
sw: Mpangilio

source: Change Language
sw: Badili lugha

# onboardingWelcomeTitle
source: Welcome to Ubunifu Portal!
sw: Karibu kwenye Ubunifu Portal!

# onboardNext
source: Next
sw: Mbele

# onboardSkip
source: Skip
sw: Ruka

# onboardingWelcomeDescription
source: Experience innovation and convenience like never before. Join us on a journey to redefine your digital experience.
sw: Pata uzoefu wa uvumbuzi na urahisi kama haujawahi kuona. Jiunge nasi katika safari ya kubadilisha uzoefu wako wa kidijitali.

# onboardingMissionTitle
source: Company Mission
sw: Dhamira ya Kampuni

# onboardingMissionDescription
source: At eGA, we believe in creating solutions that empower you. Building technology that connects, enhances, and simplifies your world.
sw: Katika eGA, tunaamini katika kuunda suluhisho zinazokupa nguvu. Kujenga teknolojia inayounganisha, kuboresha, na kurahisisha ulimwengu wako.

# onboardingValuesTitle
source: Core Values
sw: Maadili ya Msingi

# onboardingValuesDescription
source: Driven by integrity, innovation, customer centric and much more. Committed to quality. Designed with purpose. Developed with care.
sw: Tunaongozwa na uadilifu, uvumbuzi, kujali wateja na zaidi. Tumejitolea kwa ubora. Imeundwa kwa madhumuni. Imeandaliwa kwa uangalifu.

# onboardingGetStartedTitle
source: Let''s Get Started
sw: Tuanzishe

# onboardingGetStartedDescription
source: Let’s get started! The future of Our Country is at your fingertips. Ready to elevate your experience? Let’s dive in.
sw: Tuanze! teknolojia ya Tanzania ipo kwenye vidole vyako. Uko tayari kuinua uzoefu wako? Hebu tuingie.

source: Welcome back
sw: Karibu tena

source: Email
sw: Barua pepe

source: Password
sw: Nenosiri

source: Confirm Password
sw: Thibitisha Nenosiri

# forgot_password
source: Forgot a password?
sw: Umesahau nenosiri?

source: Login
sw: Ingia

# sign_up_prompt
source: 'Don't have account? Sign up here
sw: Je, Huna akaunti? Jisajili hapa

# register_page_register_button
source: Register
sw: Sajiri

# register_page_title
source: Create an account
sw: Fungua akaunti

# sign_in_prompt
source: Already have account? Sign In here
sw: Tayari una akaunti? Ingia hapa

source: Recover Password
sw: Rejesha Nenosiri

# back_to_login
source: return to login
sw: Rudi kwenye kuingia

# emailRequired
source: Email is required
sw: Barua pepe inahitajika

# validEmail
source: Enter a valid email address
sw: Ingiza anwani sahihi ya barua pepe

# passwordRequired
source: Password is required
sw: Nenosiri linahitajika

# registerPasswordCriteria
source: Password must contain {criteria}
sw: Nenosiri lazima liwe na {criteria}

# confirmPasswordRequired
source: Confirm password is required
sw: Thibitisha nenosiri linahitajika

source: Passwords do not match
sw: Nenosiri hayafai

# nameRequired
source: Name is required
sw: Jina linahitajika

# nameInvalid
source: Name must not contain numbers or special characters
sw: Jina halipaswi kuwa na nambari au alama maalum

# numberRequired
source: Number is required
sw: Nambari inahitajika

# onlyNumbersAllowed
source: Only numbers are allowed
sw: Nambari pekee ndiyo inayokubalika

# criteriaMinLength
source: at least 8 characters
sw: angalau herufi 8

# criteriaUppercase
source: 1 uppercase letter
sw: herufi moja kubwa

# criteriaLowercase
source: 1 lowercase letter
sw: herufi moja ndogo

# criteriaNumber
source: 1 number
sw: nambari moja

# criteriaSpecialChar
source: 1 special character
sw: herufi maalum moja

source: Old password
sw: Weka nenosiri la sasa

source: New password
sw: Weka nenosiri jipya

# changepin
source: Change password
sw: Badili nenosiri

# staffLoggedIn
source: Staff successfully logged in
sw: Umeingia kwa mafanikio kama mfanyakazi

# success
source: Successful!
sw: Mafanikio!

# adminLoggedIn
source: Admin successfully Logged in
sw: Umeingia kwa mafanikio kama msimamizi

source: Enter As Admin
sw: Ingia Msimamizi

source: Monitoring System
sw: Mfumo wa Ufuatiliaji

source: Yesterday
sw: Jana

source: Add Staff
sw: Ongeza mfanyakazi

source: Enter Username
sw: Ingiza jina la mtumiaji

source: Username
sw: Jina la mtumiaji

source: Enter email
sw: Ingiza barua pepe

source: Check number
sw: Nambari ya malipo

source: Enter check number
sw: Ingiza nambari ya malipo

source: Enter password
sw: Ingiza nenosiri

source: Enter confirm password
sw: Ingiza uthibitisho wa nenosiri

source: Submit
sw: Tuma

source: Monday
sw: Jumatatu

source: Tuesday
sw: Jumanne

source: Wednesday
sw: Jumatano

source: Thursday
sw: Alhamisi

source: Friday
sw: Ijumaa

source: Saturday
sw: Jumamosi

source: Sunday
sw: Jumapili

source: Select Day
sw: Chagua siku

source: Start Time
sw: Muda wa Kuingia

source: End Time
sw: Muda wa kutoka

source: Add Time range
sw: Ongeza wigo wa muda

source: Add
sw: Ongeza

source: Cancel
sw: Ghairi

# fillAllPrompt
source: Please fill all fields
sw: Tafadhari jaza nafasi zote

source: Save Changes
sw: Hifadhi mabadiliko

source: Staff Details
sw: Taarifa za mfanyakazi

source: Admin History
sw: Kumbukumbu za msimamizi

source: Total Signin
sw: Jumla ya Kuingia

source: Total Signout
sw: Jumla ya kutoka

source: Total Leaves
sw: Jumla ya Likizo

source: Signin At
sw: Kuingia Saa

source: Signout At
sw: Kutoka Saa

source: Working Hours
sw: Saa za Kazi

source: Signin
sw: Kuingia

source: Complete
sw: Imekamilika

source: No action
sw: Hakuna hatua

# detailsAboutLogs
source: Here are a few more details about user logs.
sw: Maelezo zaidi kuhusu kumbukumbu za mtumiaji.

source: Device 1 ID:
sw: Kitambulisho cha Kifaa 1:

source: Device 2 ID:
sw: Kitambulisho cha Kifaa 2:

source: Attendance Logs
sw: Kumbukumbu za Mahudhurio

source: Staff History
sw: Kumbukumbu za mfanyakazi

source: Home
sw: Nyumbani

source: History
sw: Kumbukumbu

source: Leave
sw: Ondoka

# requestFinger
source: Please place your finger on the sensor for scanning...
sw: Tafadhali weka kidole chako kwenye sensa kwa ajili ya kuskani...

source: Absent
sw: Hawapo

source: Leave request
sw: Maombi ya likizo

source: Total Officer
sw: Jumla ya Maafisa

# staff
source: Staffs
sw: Wafanyakazi

# timerange
source: Timeranges
sw: Wigo wa muda

source: Dashboard
sw: Dashibodi

source: Tell a friend
sw: Mwambie rafiki

# welcomeBack
source: Welcome Back, User!
sw: Karibu tena

# trackYourAttendance
source: Track your attendance with ease using biometric authentication.
sw: Fuatilia mahudhurio yako kwa urahisi kwa kutumia uthibitishaji wa kibayometriki.

source: Change Theme
sw: Badili Mandhari

# quicklyMark
source: Quickly mark your attendance using your fingerprint or face.
sw: Weka alama kwa haraka kuhudhuria kwako kwa kutumia alama ya vidole au uso wako.

# viewPastAttendance
source: View your past attendance records and summaries.
sw: Tazama rekodi zako za mahudhurio zilizopita na muhtasari.

source: Attendance History
sw: Kumbukumbu ya mahudhurio

source: Settings
sw: Mpangilio

# manageYourAccount
source: Manage your account settings and preferences.
sw: Dhibiti mipangilio na mapendeleo ya akaunti yako.

# todayAttendance
source: Today’s Attendance Status
sw: Hali ya mahudhurio ya leo

# successfullyMarkedAttendance
source: You have successfully marked your attendance for today.
sw: Umefanikiwa kuweka alama ya mahudhurio yako ya leo.

source: View Details
sw: Tazama Maelezo

source: Mark Attendance
sw: Weka Alama ya Mahudhurio

source: View Calendar
sw: Tazama Kalenda

source: Contact Us
sw: Wasiliana Nasi

source: Privacy Policy
sw: Sera ya Faragha

source: Terms of Service
sw: Masharti ya Huduma

# noNetworkConnection
source: No network connection available
sw: Hakuna muunganisho wa mtandao unaopatikana

source: Location permission denied
sw: Ruhusa ya eneo imekataliwa

# noIPFound
source: No IP Address Found
sw: Hakujaonekana anwani ya IP

# noNetworkInterfaces
source: No network interfaces found.
sw: Hakuna interfaces za mtandao zilizopatikana.

# wifiUnauthorized
source: User is connected to an unauthorized Wi-Fi IP address.
sw: Mtumiaji ameunganishwa na anwani ya IP isiyo ruhusiwa ya Wi-Fi.

# connectionError
source: Failed to get Wi-Fi information:
sw: Imeshindikana kupata habari za Wi-Fi:

# permissionGranted
source: Permission granted, you can proceed with getting Wi-Fi info
sw: Ruhusa imetolewa, unaweza kuendelea na kupata habari za Wi-Fi

source: Permission not granted
sw: Ruhusa haijatolewa

# signInNotification
source: You are connected to the allowed Wi-Fi network.
sw: Umekamilisha kuunganishwa na mtandao wa Wi-Fi ulio ruhusiwa.

source: Last Activity
sw: Shughuli za Mwisho

# signInFailureNotification
source: You are not connected to the allowed Wi-Fi network.
sw: Hujajiunga na mtandao wa Wi-Fi ulio ruhusiwa.

# fingerprintSuccess
source: Fingerprint successfully signed in
sw: Kidole kimefanikiwa kuskani

# fingerprintFailure
source: Fingerprint not recognized
sw: Kidole hakijatambuliwa

source: Time In
sw: Kuingia

source: Time Out
sw: Kutoka

source: Sign Out
sw: Ondoka

# appTitle
source: ICT Officer - eGA
sw: Afisa Tehama - eGA

source: My Profile
sw: Profaili Yangu

source: e-Government
sw: Serikali mtandao

source: Enable
sw: Ruhusu

source: Notification
sw: Taarifa

source: Change
sw: Badili

source: Settings & Profile
sw: Mpangilio na Profaili

source: Device Unsafe
sw: Kifaa Hakiko Salama

# app_run_error
source: This app cannot run on rooted or emulated devices, or with developer options enabled.
sw: Programu hii haiwezi kufanya kazi kwenye vifaa vilivyozuiliwa, au ikiwa chaguo la maendeleo limewezeshwa.

# use_physical_device
source: Please use a physical device without root access and ensure developer options are disabled to use this app.
sw: Tafadhali tumia kifaa halisi kisichokuwa na upatikanaji wa root na hakikisha chaguo la maendeleo limezuiwa ili kutumia programu hii.

# biometricAppTitle
source: Biometric Attendance App
sw: Programu ya Usajili wa Biometriki

# lastActivitySignOut
source: Sign Out
sw: Kutoka

# hey
source: Habari
sw: This is hey
